# DateFrame 의 탐색

### https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV 이 주소로 부터 데이터를 받아와 실습을 할 예정

##### 출처 : data는 Data Insight 한기영 대표님께서 제공해주신 데이터

In [2]:
# pandas 라이브러리 불러오기
import pandas as pd

In [3]:
# 주소를 통해 데이터 불러오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV'
data = pd.read_csv(path)

In [4]:
# 상위 5개 data 확인하기 default 값 = 5 
data.head()

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

In [5]:
# 하위 5개 data 확인하기 
data.tail()

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1191,0,32,5,1555,Female,2,Married,5878,No,12,12
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1193,0,29,9,1558,Male,3,Married,2451,No,18,5
1194,0,29,2,469,Male,3,Married,4649,No,14,4
1195,0,43,16,327,Female,4,Married,16064,Yes,22,22

In [6]:
# datad의 모양 확인하기 (행,열)
data.shape

(1196, 11)

In [7]:
# 데이터 확인하기 배열 형태로 나온다.
data.values

array([[0, 33, 7, ..., 'No', 11, 14],
       [0, 35, 18, ..., 'No', 11, 10],
       [0, 42, 6, ..., 'No', 13, 18],
       ...,
       [0, 29, 9, ..., 'No', 18, 5],
       [0, 29, 2, ..., 'No', 14, 4],
       [0, 43, 16, ..., 'Yes', 22, 22]], dtype=object)

In [12]:
# 열의 이름들을 확인하기
data.columns.values

array(['Attrition', 'Age', 'DistanceFromHome', 'EmployeeNumber', 'Gender',
       'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome', 'OverTime',
       'PercentSalaryHike', 'TotalWorkingYears'], dtype=object)

In [9]:
# 열의 이름들을 확인하기(동일)
data.columns

Index(['Attrition', 'Age', 'DistanceFromHome', 'EmployeeNumber', 'Gender',
       'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome', 'OverTime',
       'PercentSalaryHike', 'TotalWorkingYears'],
      dtype='object')

In [8]:
# 열들의 타입 확인하기
data.dtypes

Attrition             int64
Age                   int64
DistanceFromHome      int64
EmployeeNumber        int64
Gender               object
JobSatisfaction       int64
MaritalStatus        object
MonthlyIncome         int64
OverTime             object
PercentSalaryHike     int64
TotalWorkingYears     int64
dtype: object

In [14]:
#열의 정보들을 확인하기 null 값이 있는지 , 무슨 type 인지 이름이 무엇인지
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1196 entries, 0 to 1195
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Attrition          1196 non-null   int64
 1   Age                1196 non-null   int64
 2   DistanceFromHome   1196 non-null   int64
 3   EmployeeNumber     1196 non-null   int64
 4   Gender             1196 non-null   object
 5   JobSatisfaction    1196 non-null   int64
 6   MaritalStatus      1196 non-null   object
 7   MonthlyIncome      1196 non-null   int64
 8   OverTime           1196 non-null   object
 9   PercentSalaryHike  1196 non-null   int64
 10  TotalWorkingYears  1196 non-null   int64
dtypes: int64(8), object(3)
memory usage: 102.9+ KB

In [15]:
# 열의 갯수, 평균, 표준편차 최솟값, 4분위수, 최댓값을 나타낸다 . (기초 통계 정보확인)
data.describe()

,Attrition,Age,DistanceFromHome,EmployeeNumber,JobSatisfaction,MonthlyIncome,PercentSalaryHike,TotalWorkingYears
count,1196.000000,1196.00000,1196.000000,1196.000000,1196.000000,1196.000000,1196.000000,1196.000000
mean,0.163043,36.94398,9.258361,1035.629599,2.716555,6520.104515,15.251672,11.330268
std,0.369560,9.09270,8.166016,604.340130,1.110962,4665.902253,3.625946,7.823821
min,0.000000,18.00000,1.000000,1.000000,1.000000,1009.000000,11.000000,0.000000
25%,0.000000,30.00000,2.000000,507.750000,2.000000,2928.250000,12.000000,6.000000
50%,0.000000,36.00000,7.000000,1028.000000,3.000000,4973.500000,14.000000,10.000000
75%,0.000000,43.00000,14.000000,1581.250000,4.000000,8420.500000,18.000000,15.000000
max,1.000000,60.00000,29.000000,2068.000000,4.000000,19999.000000,25.000000,40.000000

In [17]:
# 열 중에서 Age 의 기초 통계 정보확인 
data[['Age']].describe()

              Age
count  1196.00000
mean     36.94398
std       9.09270
min      18.00000
25%      30.00000
50%      36.00000
75%      43.00000
max      60.00000

In [21]:
# Gender 열의 고유한 값을 확인한다.
data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [22]:
# Gender 열의 고유한 값들의 갯수가 어떻게 되는지 확인한다.
data['Gender'].value_counts()

Male      727
Female    469
Name: Gender, dtype: int64

# DateFrame 의 집계

In [23]:
# Age 열의 합
data['Age'].sum()

44185

In [24]:
# Age 열의 최대값
data['Age'].max()

60

In [25]:
# Age 열의 평균값
data['Age'].mean()

36.94397993311037

In [9]:
# Age 열의 중앙값
data['Age'].median()

36.0

In [10]:
# Age 열의 최솟값
data['Age'].min()

18